// ---------------------------------------------------------------------
// Информация о текущем состоянии исполнения процессора инструкции
// ---------------------------------------------------------------------

reg [7:0] cstate        = 0;    // Микроадрес

// Параметры инструкции
reg [8:0] opcode        = 0;    // Сохраненный опкод
reg [2:0] segment_id    = 0;    // Номер сегмента (для override)
reg       segment_of    = 0;    // =1 Сегмент находится в префиксе
reg       opsize        = 0;    // Размер операнда (16, 32/64)
reg       adsize        = 0;    // Размер адреса (16, 32/64)
reg       lock          = 0;    // Префикс LOCK:
reg [1:0] rep           = 0;    // 0: NZ, Z; 1: Наличие REP
reg       fmodrm        = 0;    // =1 Есть байт modrm, прочесть его

initial begin

    rd = 0;
    wr = 0;
    o_data = 0;

end
